IDEA Open Model
ConnectionResultsData Class
Compatible with IDEA StatiCa Beta 20.0
 Results for all connections in project
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConnectionResultsData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class ConnectionResultsData
<SerializableAttribute>
Public Class ConnectionResultsData
The ConnectionResultsData type exposes the following members.
Constructors
Name | Description
ConnectionResultsData
 Constructor
Top
Properties
Name | Description
ConnectionCheckRes
 List of ConnectionCheckRes
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace